{
  "\n": 9, 
  "\r": 10, 
  " ": 0, 
  "!": 29, 
  "\"": 34, 
  "#": 138, 
  "%": 89, 
  "&": 80, 
  "'": 73, 
  "(": 91, 
  ")": 92, 
  "*": 105, 
  "+": 104, 
  ",": 54, 
  "-": 63, 
  ".": 46, 
  "/": 66, 
  "0": 55, 
  "1": 50, 
  "2": 51, 
  "3": 62, 
  "4": 74, 
  "5": 71, 
  "6": 76, 
  "7": 75, 
  "8": 84, 
  "9": 78, 
  ":": 82, 
  "<": 83, 
  "=": 77, 
  ">": 85, 
  "?": 26, 
  "@": 135, 
  "A": 27, 
  "B": 47, 
  "C": 60, 
  "D": 59, 
  "E": 48, 
  "F": 67, 
  "G": 70, 
  "H": 32, 
  "I": 24, 
  "J": 87, 
  "K": 79, 
  "L": 39, 
  "M": 56, 
  "N": 49, 
  "O": 28, 
  "P": 81, 
  "Q": 120, 
  "R": 64, 
  "S": 35, 
  "T": 33, 
  "U": 61, 
  "V": 94, 
  "W": 36, 
  "X": 111, 
  "Y": 44, 
  "Z": 107, 
  "^": 119, 
  "_": 65, 
  "a": 4, 
  "b": 23, 
  "c": 20, 
  "d": 13, 
  "e": 1, 
  "f": 22, 
  "g": 19, 
  "h": 7, 
  "i": 5, 
  "j": 41, 
  "k": 18, 
  "l": 12, 
  "m": 16, 
  "n": 6, 
  "o": 3, 
  "p": 21, 
  "q": 86, 
  "r": 11, 
  "s": 8, 
  "t": 2, 
  "u": 14, 
  "v": 25, 
  "w": 17, 
  "x": 52, 
  "y": 15, 
  "z": 57, 
  "\u00a0": 137, 
  "\u00a1": 125, 
  "\u00a2": 145, 
  "\u00a4": 69, 
  "\u00a6": 99, 
  "\u00a7": 133, 
  "\u00a9": 117, 
  "\u00aa": 127, 
  "\u00ab": 110, 
  "\u00ac": 130, 
  "\u00ad": 101, 
  "\u00ae": 128, 
  "\u00af": 134, 
  "\u00b0": 139, 
  "\u00b1": 126, 
  "\u00b3": 113, 
  "\u00b5": 118, 
  "\u00b7": 100, 
  "\u00b8": 68, 
  "\u00b9": 102, 
  "\u00ba": 146, 
  "\u00bb": 103, 
  "\u00bc": 53, 
  "\u00bd": 142, 
  "\u00be": 147, 
  "\u00bf": 58, 
  "\u00c3": 106, 
  "\u00e2": 30, 
  "\u00e3": 97, 
  "\u00e4": 140, 
  "\u00e5": 108, 
  "\u00e6": 121, 
  "\u00e7": 136, 
  "\u00e8": 123, 
  "\u00e9": 143, 
  "\u00ea": 149, 
  "\u00eb": 114, 
  "\u00ec": 141, 
  "\u00ef": 45, 
  "\u00f0": 40, 
  "\u0152": 96, 
  "\u0153": 90, 
  "\u0160": 112, 
  "\u0178": 37, 
  "\u017e": 115, 
  "\u02c6": 148, 
  "\u02dc": 43, 
  "\u2013": 116, 
  "\u2014": 131, 
  "\u2018": 88, 
  "\u2019": 109, 
  "\u201a": 72, 
  "\u201c": 132, 
  "\u201d": 144, 
  "\u2020": 98, 
  "\u2021": 129, 
  "\u2022": 122, 
  "\u2026": 95, 
  "\u2030": 124, 
  "\u2039": 93, 
  "\u20ac": 31, 
  "\u2122": 38, 
  "\ufffd": 42
}