{
  "\n": 5, 
  "\r": 6, 
  " ": 0, 
  "!": 44, 
  "\"": 31, 
  "#": 143, 
  "$": 136, 
  "%": 153, 
  "&": 138, 
  "'": 32, 
  "(": 83, 
  ")": 112, 
  "*": 110, 
  "+": 131, 
  ",": 60, 
  "-": 63, 
  ".": 27, 
  "/": 90, 
  "0": 79, 
  "1": 80, 
  "2": 86, 
  "3": 82, 
  "4": 103, 
  "5": 87, 
  "6": 107, 
  "7": 113, 
  "8": 115, 
  "9": 105, 
  ":": 69, 
  ";": 152, 
  "<": 85, 
  "=": 125, 
  ">": 92, 
  "?": 29, 
  "A": 26, 
  "B": 47, 
  "C": 45, 
  "D": 46, 
  "E": 39, 
  "F": 62, 
  "G": 61, 
  "H": 37, 
  "I": 20, 
  "J": 74, 
  "K": 81, 
  "L": 35, 
  "M": 50, 
  "N": 38, 
  "O": 25, 
  "P": 64, 
  "Q": 135, 
  "R": 58, 
  "S": 36, 
  "T": 28, 
  "U": 48, 
  "V": 111, 
  "W": 34, 
  "X": 130, 
  "Y": 33, 
  "Z": 118, 
  "^": 116, 
  "_": 71, 
  "a": 4, 
  "b": 24, 
  "c": 18, 
  "d": 15, 
  "e": 1, 
  "f": 22, 
  "g": 17, 
  "h": 9, 
  "i": 8, 
  "j": 41, 
  "k": 21, 
  "l": 12, 
  "m": 14, 
  "n": 7, 
  "o": 2, 
  "p": 23, 
  "q": 89, 
  "r": 11, 
  "s": 10, 
  "t": 3, 
  "u": 13, 
  "v": 30, 
  "w": 19, 
  "x": 67, 
  "y": 16, 
  "z": 51, 
  "~": 119, 
  "\u00a0": 75, 
  "\u00a1": 122, 
  "\u00a3": 148, 
  "\u00a4": 76, 
  "\u00a5": 98, 
  "\u00a6": 95, 
  "\u00a7": 93, 
  "\u00a8": 53, 
  "\u00a9": 132, 
  "\u00aa": 128, 
  "\u00ab": 149, 
  "\u00ac": 117, 
  "\u00ad": 144, 
  "\u00ae": 154, 
  "\u00af": 150, 
  "\u00b0": 77, 
  "\u00b1": 145, 
  "\u00b2": 146, 
  "\u00b3": 101, 
  "\u00b4": 104, 
  "\u00b5": 139, 
  "\u00b6": 120, 
  "\u00b7": 123, 
  "\u00b8": 72, 
  "\u00b9": 114, 
  "\u00ba": 151, 
  "\u00bb": 142, 
  "\u00bc": 55, 
  "\u00bd": 127, 
  "\u00be": 141, 
  "\u00bf": 59, 
  "\u00e2": 54, 
  "\u00e3": 57, 
  "\u00ea": 106, 
  "\u00eb": 42, 
  "\u00ec": 43, 
  "\u00ed": 78, 
  "\u00ef": 52, 
  "\u00f0": 66, 
  "\u0152": 96, 
  "\u0153": 99, 
  "\u0160": 134, 
  "\u0161": 88, 
  "\u0178": 65, 
  "\u017d": 126, 
  "\u017e": 97, 
  "\u0192": 137, 
  "\u02c6": 94, 
  "\u02dc": 91, 
  "\u2013": 108, 
  "\u2014": 100, 
  "\u2018": 102, 
  "\u2019": 140, 
  "\u201a": 121, 
  "\u201c": 129, 
  "\u201d": 109, 
  "\u201e": 84, 
  "\u2021": 147, 
  "\u2022": 73, 
  "\u2026": 56, 
  "\u2030": 133, 
  "\u2039": 68, 
  "\u203a": 124, 
  "\u20ac": 40, 
  "\u2122": 70, 
  "\ufffd": 49
}